note/Info(C-h i)/OrgMode/note.org
#+TITLE Org Mode
* introduction
** Summary
** Installation
** Activeation
** Feedback
** Typesetting conventions used in this manual
keybindings
C-c a org-agenda
C-c c org-capture
* Dcoument structure
** ^
Org is based on Outline mode
** Outlines
   <TAB>  org-cycle
** Headlines
stars * one or more
org-footnote-section, which defaults to Footnotes
org-cycle-separator-lines

‘org-special-ctrl-a/e’, ‘org-special-ctrl-k’, ‘org-ctrl-k-protect-subtree’ 
** Visibility cycling
*** Global and local cycling
 ‘<TAB>’     (‘org-cycle’)
 ‘S-<TAB>’     (‘org-global-cycle’)
 C-u <TAB>
 N + S-<TAB>   show level N 
 ‘C-u C-u <TAB>’     (‘org-set-startup-visibility’)
 ‘C-u C-u C-u <TAB>’     (‘outline-show-all’)
 ‘C-c C-r’     (‘org-reveal’) in sparse trees or agenda commads
 ‘C-c C-k’     (‘outline-show-branches’)
 N + ‘C-c <TAB>’     (‘outline-show-children’)
 N + ‘C-c C-x b’     (‘org-tree-to-indirect-buffer’)
 ‘C-c C-x v’     (‘org-copy-visible’)
*** Initial visibility
 org-startup-folded

 per-file basis:
 #+STARTUP: showeverything
 #+STARTUP: content
 #+STARTUP: showall
 #+STARTUP: overview

 VISIBILITY (*note Properties and Columns)
 ‘C-u C-u <TAB>’     (‘org-set-startup-visibility’)

 org-agenda-inhibit-startup
*** Catching invisible edits
 org-catch-invisible-edits
** Motion
‘C-c C-n’     (‘outline-next-visible-heading’)
‘C-c C-p’     (‘outline-previous-visible-heading’)
‘C-c C-f’     (‘org-forward-same-level’)
‘C-c C-b’     (‘org-backward-same-level’)
‘C-c C-u’     (‘outline-up-heading’)
‘C-c C-j’     (‘org-goto’)
** Structure editing
 ‘M-<RET>’     (‘org-insert-heading’)
 C-u C-u M-<RET>
 ‘C-<RET>’     (‘org-insert-heading-respect-content’)
 ‘M-S-<RET>’     (‘org-insert-todo-heading’) org-treat-insert-todo-heading-as-state-change
 ‘C-S-<RET>’     (‘org-insert-todo-heading-respect-content’)
 ‘<TAB>’     (‘org-cycle’)
 ‘M-<left>’     (‘org-do-promote’)
 ‘M-<right>’     (‘org-do-demote’)
 ‘M-S-<left>’     (‘org-promote-subtree’)
 ‘M-S-<right>’     (‘org-demote-subtree’)
 ‘M-h’     (‘org-mark-element’)
‘C-c @’     (‘org-mark-subtree’)
‘C-c C-x C-w’     (‘org-cut-subtree’)
‘C-c C-x M-w’     (‘org-copy-subtree’)
‘C-c C-x C-y’     (‘org-paste-subtree’)
‘C-y’     (‘org-yank’)
‘C-c C-x c’     (‘org-clone-subtree-with-time-shift’) org-clone-subtree-with-time-shift
‘C-c C-w’     (‘org-refile’)
‘C-c ^’     (‘org-sort’)   C-u case-sensitve
‘C-x n s’     (‘org-narrow-to-subtree’)
‘C-x n b’     (‘org-narrow-to-block’)
‘C-x n w’     (‘widen’)
‘C-c *’     (‘org-toggle-heading’)
org-M-RET-may-split-line
** Sparse trees
‘C-c /’     (‘org-sparse-tree’)
‘C-c / r’  or  ‘C-c / /’     (‘org-occur’)     C-c C-c disppear    with C-U 
‘M-g n’  or  ‘M-g M-n’     (‘next-error’)
‘M-g p’  or  ‘M-g M-p’     (‘previous-error’)

org-agenda-custom-commands :
(setq org-agenda-custom-commands
           '(("f" occur-tree "FIXME")))

ps-print-buffer-with-faces
C-c C-e C-v

org-show-context-detail
org-remove-highlights-with-change
** Plain lists
*** list 
- Unordered: - + *
- Ordered: 1. 1) [@20]
- Description: unordered item :: description term

list must have same left indention.
lists ends:
1. less or equally indented than items at top level.
2. before tow blank lines.

org-list-demote-modify-bullet
org-list-indent-offset
org-list-automatic-rules
*** list keybindings
- ‘<TAB>’     (‘org-cycle’)    
  - fold items
  - new item with no text, change level
  - org-cycle-include-plain-lists
- ‘M-<RET>’     (‘org-insert-heading’)
- ‘M-S-<RET>’ checkbox
- ‘S-up’
- ‘S-down’
- ‘M-up’
- ‘M-down’
- ‘M-S-<LEFT>’
- ‘M-S-<RIGHT>’
  - org-list-automatic-rules
- ‘C-c C-c’ toggle checkbox
- ‘C-c -’ cycle bullets
  - org-plain-list-ordered-item-terminator
  - at active region all become list items.
  - C-u region become single item.
  - a normal line converted to a list item.
- ‘C-c *’ to headline
- ‘C-c C-*’ whole plain list to subtree.
  - checkbox become TODO
- ‘S-<LEFT>/<RIGHT>’ cycles bullet 
  - ‘org-support-shift-select’.
- ‘C-c ^’ sort the plain list.
*** FootnotesInfomation
- '*' must indent
- org-plain-list-ordered-item-terminator
- org-list-allow-alphabetical
- [@20]  before checkbox
- org-M-RET-may-split-line
- org-list-use-circular-motion
- org-list-use-circular-motion
** Drawers
‘C-c C-x d’   ‘org-insert-drawer’
'C-u C-c C-x d'    org-insert-property-drawer
'C-M-i'  completion over drawer
‘C-c C-z’ Add a time-stamped note
‘org-export-with-drawers’
‘org-export-with-properties’ 
** Blocks
‘org-hide-block-startup’ 
or
#+STARTUP: hideblocks
#+STARTUP: nohideblocks
** Footnotes
*** ^
‘[fn:name]’
‘[fn::This is the inline definition of this footnote]’
‘[fn:name:a definition]’
org-footnote-auto-label   ‘#+STARTUP: fninline’ or ‘#+STARTUP: nofninline’
*** commads
- ‘C-c C-x f’ jump to definition
  - create a new footnote
    - org-footnote-define-inline
    - org-footnote-section
  - C-u C-c C-x f
    - s sort
    - r renumber
      - org-footnote-auto-adjust
        - ‘fnadjust’ and ‘nofnadjust’
    - S r+s
    - n Normalize bootnotes by collecting
    - delete
- ‘C-c C-c’ jump and jump back
  - + C-u  just like C-c C-x f
- ‘C-c C-o or mouse-1/2’ links defiition/reference and follow links
- ‘C-c '’ edit in a separate window
** The Orgstruct
minor mode ‘orgstruct-mode’

‘M-x orgstruct-mode <RET>’
or
in message mode :
(add-hook 'message-mode-hook 'turn-on-orgstruct)
(add-hook 'message-mode-hook 'turn-on-orgstruct++)

orgstruct++-mode
orgstruct-heading-prefix-regexp
** Org syntax
https://orgmode.org/worg/dev/org-syntax.html
org-lint  check syntax
* Tables
** Built-in table editor
*** ^
<TAB> re-align and next field
<RET> re-align and next row
C-c C-c re-align
*** create table
| Name | Phone | Age |
|-
type <TAB>

| Name | Phone | Age |
type C-c <RET>
