note/info/OrgMode/note.tex
% Created 2019-09-01 日 12:47
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{nicolas4d}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={nicolas4d},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.11)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\#+TITLE Org Mode
\section{introduction}
\label{sec:org2054775}
\subsection{Summary}
\label{sec:orge830729}
\subsection{Installation}
\label{sec:org53aa450}
\subsection{Activeation}
\label{sec:org4de31b9}
\subsection{Feedback}
\label{sec:org702cfdd}
\subsection{Typesetting conventions used in this manual}
\label{sec:org0836ecf}
keybindings
C-c a org-agenda
C-c c org-capture
\section{Dcoument structure}
\label{sec:orgd12febb}
\subsection{\^{}}
\label{sec:org797529e}
Org is based on Outline mode
\subsection{Outlines}
\label{sec:orge0eea1a}
<TAB>  org-cycle
\subsection{Headlines}
\label{sec:orge5cce70}
stars * one or more
org-footnote-section, which defaults to Footnotes
org-cycle-separator-lines

‘org-special-ctrl-a/e’, ‘org-special-ctrl-k’, ‘org-ctrl-k-protect-subtree’ 
\subsection{Visibility cycling}
\label{sec:org4ce4483}
\subsubsection{Global and local cycling}
\label{sec:org3e6facc}
‘<TAB>’     (‘org-cycle’)
‘S-<TAB>’     (‘org-global-cycle’)
C-u <TAB>
N + S-<TAB>   show level N 
‘C-u C-u <TAB>’     (‘org-set-startup-visibility’)
‘C-u C-u C-u <TAB>’     (‘outline-show-all’)
‘C-c C-r’     (‘org-reveal’) in sparse trees or agenda commads
‘C-c C-k’     (‘outline-show-branches’)
N + ‘C-c <TAB>’     (‘outline-show-children’)
N + ‘C-c C-x b’     (‘org-tree-to-indirect-buffer’)
‘C-c C-x v’     (‘org-copy-visible’)
\subsubsection{Initial visibility}
\label{sec:org221532f}
org-startup-folded

per-file basis:
VISIBILITY (*note Properties and Columns)
‘C-u C-u <TAB>’     (‘org-set-startup-visibility’)

org-agenda-inhibit-startup
\subsubsection{Catching invisible edits}
\label{sec:org838bed7}
org-catch-invisible-edits
\subsection{Motion}
\label{sec:org7535c8e}
‘C-c C-n’     (‘outline-next-visible-heading’)
‘C-c C-p’     (‘outline-previous-visible-heading’)
‘C-c C-f’     (‘org-forward-same-level’)
‘C-c C-b’     (‘org-backward-same-level’)
‘C-c C-u’     (‘outline-up-heading’)
‘C-c C-j’     (‘org-goto’)
\subsection{Structure editing}
\label{sec:orgad8f5a6}
 ‘M-<RET>’     (‘org-insert-heading’)
 C-u C-u M-<RET>
 ‘C-<RET>’     (‘org-insert-heading-respect-content’)
 ‘M-S-<RET>’     (‘org-insert-todo-heading’) org-treat-insert-todo-heading-as-state-change
 ‘C-S-<RET>’     (‘org-insert-todo-heading-respect-content’)
 ‘<TAB>’     (‘org-cycle’)
 ‘M-<left>’     (‘org-do-promote’)
 ‘M-<right>’     (‘org-do-demote’)
 ‘M-S-<left>’     (‘org-promote-subtree’)
 ‘M-S-<right>’     (‘org-demote-subtree’)
 ‘M-h’     (‘org-mark-element’)
‘C-c @’     (‘org-mark-subtree’)
‘C-c C-x C-w’     (‘org-cut-subtree’)
‘C-c C-x M-w’     (‘org-copy-subtree’)
‘C-c C-x C-y’     (‘org-paste-subtree’)
‘C-y’     (‘org-yank’)
‘C-c C-x c’     (‘org-clone-subtree-with-time-shift’) org-clone-subtree-with-time-shift
‘C-c C-w’     (‘org-refile’)
‘C-c \^{}’     (‘org-sort’)   C-u case-sensitve
‘C-x n s’     (‘org-narrow-to-subtree’)
‘C-x n b’     (‘org-narrow-to-block’)
‘C-x n w’     (‘widen’)
‘C-c *’     (‘org-toggle-heading’)
org-M-RET-may-split-line
\subsection{Sparse trees}
\label{sec:orgfa977b5}
‘C-c /’     (‘org-sparse-tree’)
‘C-c / r’  or  ‘C-c / /’     (‘org-occur’)     C-c C-c disppear    with C-U 
‘M-g n’  or  ‘M-g M-n’     (‘next-error’)
‘M-g p’  or  ‘M-g M-p’     (‘previous-error’)

org-agenda-custom-commands :
(setq org-agenda-custom-commands
           '(("f" occur-tree "FIXME")))

ps-print-buffer-with-faces
C-c C-e C-v

org-show-context-detail
org-remove-highlights-with-change
\subsection{Plain lists}
\label{sec:org947b3e0}
\subsubsection{list}
\label{sec:orgaed4ac0}
\begin{itemize}
\item Unordered: - + *
\item Ordered: 1. 1) [@20]
\item[{Description: unordered item}] description term
\end{itemize}

list must have same left indention.
lists ends:
\begin{enumerate}
\item less or equally indented than items at top level.
\item before tow blank lines.
\end{enumerate}

org-list-demote-modify-bullet
org-list-indent-offset
org-list-automatic-rules
\subsubsection{list keybindings}
\label{sec:org34f917a}
\begin{itemize}
\item ‘<TAB>’     (‘org-cycle’)    
\begin{itemize}
\item fold items
\item new item with no text, change level
\item org-cycle-include-plain-lists
\end{itemize}
\item ‘M-<RET>’     (‘org-insert-heading’)
\item ‘M-S-<RET>’ checkbox
\item ‘S-up’
\item ‘S-down’
\item ‘M-up’
\item ‘M-down’
\item ‘M-S-<LEFT>’
\item ‘M-S-<RIGHT>’
\begin{itemize}
\item org-list-automatic-rules
\end{itemize}
\item ‘C-c C-c’ toggle checkbox
\item ‘C-c -’ cycle bullets
\begin{itemize}
\item org-plain-list-ordered-item-terminator
\item at active region all become list items.
\item C-u region become single item.
\item a normal line converted to a list item.
\end{itemize}
\item ‘C-c *’ to headline
\item ‘C-c C-*’ whole plain list to subtree.
\begin{itemize}
\item checkbox become TODO
\end{itemize}
\item ‘S-<LEFT>/<RIGHT>’ cycles bullet 
\begin{itemize}
\item ‘org-support-shift-select’.
\end{itemize}
\item ‘C-c \^{}’ sort the plain list.
\end{itemize}
\subsubsection{FootnotesInfomation}
\label{sec:org3c04905}
\begin{itemize}
\item '*' must indent
\item org-plain-list-ordered-item-terminator
\item org-list-allow-alphabetical
\setcounter{enumi}{19}
\item before checkbox
\item org-M-RET-may-split-line
\item org-list-use-circular-motion
\item org-list-use-circular-motion
\end{itemize}
\subsection{Drawers}
\label{sec:orgcfe4a3e}
‘C-c C-x d’   ‘org-insert-drawer’
'C-u C-c C-x d'    org-insert-property-drawer
'C-M-i'  completion over drawer
‘C-c C-z’ Add a time-stamped note
‘org-export-with-drawers’
‘org-export-with-properties’ 
\subsection{Blocks}
\label{sec:orge7957fa}
‘org-hide-block-startup’ 
or
\subsection{The Orgstruct}
\label{sec:org15fa10e}
minor mode ‘orgstruct-mode’

‘M-x orgstruct-mode <RET>’
or
in message mode :
(add-hook 'message-mode-hook 'turn-on-orgstruct)
(add-hook 'message-mode-hook 'turn-on-orgstruct++)

orgstruct++-mode
orgstruct-heading-prefix-regexp
\subsection{Org syntax}
\label{sec:orgde8eb12}
\url{https://orgmode.org/worg/dev/org-syntax.html}
org-lint  check syntax
\section{Tables}
\label{sec:orgf33bf5a}
\subsection{Built-in table editor}
\label{sec:orgb3ce69d}
\subsubsection{\^{}}
\label{sec:orgc03304f}
<TAB> re-align and next field
<RET> re-align and next row
C-c C-c re-align
