note/Info(C-h i)/OrgMode/note.org
*** keybindings
- ‘C-c |     (org-table-create-or-convert-from-region)’
  - convert region to table
  - C-u ‘C-u’ forces CSV, ‘C-u C-u’ forces TAB, ‘C-u C-u C-u’ will prompt for a regular expression.
  - no active region then just create
- ‘C-c C-c     (org-table-align)’
- ‘C-c <SPC>     (org-table-blank-field)’
- ‘<TAB>     (org-table-next-field)’
- ‘S-<TAB>     (org-table-previous-field)’
- ‘<RET>     (org-table-next-row)’
- ‘M-a     (org-table-beginning-of-field)’
- ‘M-e     (org-table-end-of-field)’
- ‘M-<LEFT>     (org-table-move-column-left)’
- ‘M-<RIGHT>     (org-table-move-column-right)’
- ‘M-S-<LEFT>     (org-table-delete-column)’
- ‘M-S-<RIGHT>     (org-table-insert-column)’
- ‘M-<UP>     (org-table-move-row-up)’
- ‘M-<DOWN>     (org-table-move-row-down)’
- ‘M-S-<UP>     (org-table-kill-row)’
- ‘M-S-<DOWN>     (org-table-insert-row)’
- ‘C-c -     (org-table-insert-hline)’
- ‘C-c <RET>     (org-table-hline-and-move)’
  - + C-c
- ‘C-c C-x M-w     (org-table-copy-region)’
- ‘C-c C-x C-w     (org-table-cut-region)’
- ‘C-c C-x C-y     (org-table-paste-rectangle)’
- ‘M-<RET>     (org-table-wrap-region)’
  - + C-u change the number of desired lines.
- ‘C-c +     (org-table-sum)’
  - inserted with C-y
- ‘S-<RET>     (org-table-copy-down)’
  - integer field values will be incremented. prefix 0 disable increment.
- ‘C-c `     (org-table-edit-field)’
  - in a separate window
  - + C-u full visible
  - + C-u C-u separate window follow the cursor.
- ‘M-x org-table-import <RET>’
  - import a file as a table. separator <TAB>
  - + C-u determine the separator.
- ‘C-c |     (org-table-create-or-convert-from-region)’
- ‘M-x org-table-export <RET>’
  - ‘org-table-export-default-format’.‘TABLE_EXPORT_FILE’ and ‘TABLE_EXPORT_FORMAT’
*** footnoteInfo
(1) To insert a vertical bar into a table field, use ‘\vert’ or,
inside a word ‘abc\vert{}def’.
** Column width and alignment
set width of a column:
<N>
inside field.

C-c ` 

‘org-startup-align-all-tables’ 
per-file basis with:
#+STARTUP: align
#+STARTUP: noalign

alignment:
<r><c><l>
** Column groups
| N | N^2 | N^3 | N^4 | ~sqrt(n)~ | ~sqrt[4](N)~ |
|---+-----+-----+-----+-----------+--------------|
| / |   < |     |   > |         < |            > |
| 1 |   1 |   1 |   1 |         1 |            1 |
|---+-----+-----+-----+-----------+--------------|
** Orgtbl mode
‘M-x orgtbl-mode <RET>’.

(add-hook 'message-mode-hook 'turn-on-orgtbl)
** The spreadsheet
*** References
**** ^
C-c ?  coordinates of a field are.
C-c }  toggle the display of a grid.
**** Field references
- @ROW$COLUMN
  - column
    - $0 current
    - $1 $2 ...
    - $+1 ...
    - $< first $> last
    - $>>> third column from the right
  - row
    - @0 current
    - @1 ...
    - @+1 ...
    - @< @>
    - @I first hline(horizontal separator)
    - @II
    - @-1
    - @III+2
- references
 - with unsigned numbers fixed.
 - with signed numbers relative.
**** Range references
...
return a vector
**** Field coordinates in formulas
@# org-table-current-dline
$# org-table-current-column
**** Named references
$name
org-table-formula-constants

$PROP_Xyz
- constants.el
  - $I #+STARTUP  constSI 
  - cgs #+STARTUP  constcgs
  - constants-unit-system
**** Remote references
- remote(NAME-OR-ID,REF)
  - NAME ‘#+NAME: Name’ line before the table.
  - NAME @ROW$COLUMN    this is indirection of NAME-OR-ID.
*** Formula syntax for Calc
a/b*c  ==  a/(b*c)
mode string after a semicolon.
‘org-calc-default-modes’.
*** Formula syntax for Lisp
'()
*** Durations and time values
*** Field and range formulas
*** Column formulas
*** Lookup functions
*** Editing and debugging formulas
*** Updating the table
*** Advanced features
** Org-Plot
*** Graphical plots using ‘Gnuplot’
*** ASCII bar plots
C-c " a
M-x orgtbl-ascii-plot <RET>
* Hyperlinks
** Link format
[[link][description] ] or [[link] ]   erase ' '
** Internal links
- ‘[ [#my-custom-id]]’ link to ‘CUSTOM_ID’ property ‘my-custom-id’.
- [[My Target]] [[My Target][find my target]]
  - C-c C-o follow link
<<My Target>>
#+NAME: My Target
search for headline

C-c &  previous position of mark ring.
Radio targets C-c C-c on target
** External links
[[string:someString] ]    no ' '
** Handling links
- ‘C-c l     (org-store-link)’
- ‘C-c C-l     (org-insert-link)’
- ‘C-u C-c C-l’  link to file
- ‘C-u C-u C-c C-l’ link to file as absolute path
- ‘C-c C-l  (with cursor on existing link)’   edit
- ‘C-c C-o     (org-open-at-point)’
  - + C-u  with emacs
  - + C-u C-u  avoid with emacs
  - org-link-frame-setup
- ‘<RET>’
  - org-return-follows-link
- ‘C-c C-x C-v     (org-toggle-inline-images)’
  - org-startup-with-inline-images
  - ‘#+STARTUP’ keywords ‘inlineimages’ and ‘noinlineimages’
- ‘C-c %     (org-mark-ring-push)’
- ‘C-c &     (org-mark-ring-goto)’
- ‘C-c C-x C-n     (org-next-link)’
- ‘C-c C-x C-p     (org-previous-link)’

** Using links outside Org
(global-set-key "\C-c L" 'org-insert-link-global)
(global-set-key "\C-c o" 'org-open-at-point-global)
** Link abbreviations
[[linkword:tag][description] ]  with no blank
(setq org-link-abbrev-alist
 '()
)
%s %h %(my-function)
[[google:OrgMode]]

#+LINK: bugzilla  http://10.1.2.9/bugzilla/show_bug.cgi?id=
#+LINK: google http://www.google.com/search?q=%s

(org-link-set-parameters ``type'' :complete #'some-function)
** Search options
:: 

[[file:~/code/main.c::255]]
[[file:~/xx.org::My Target]]
[[file:~/xx.org::*My Target]]
[[file:~/xx.org::#my-custom-id] ]
[[file:~/xx.org::/regexp/]]
[[file:::]]
** Custom searches
‘org-create-file-search-functions’
‘org-execute-file-search-functions’
* TODO items
** TODO basics
- ‘C-c C-t     (org-todo)’
  - ‘org-use-fast-todo-selection’
  - ‘C-u C-c C-t’ prompt
- ‘S-<RIGHT>  /  S-<LEFT>’ cycling
  - ‘shift-selection-mode’
  - ‘org-treat-S-cursor-todo-selection-as-state-change’
- ‘C-c / t     (org-show-todo-tree)’  view TODO items
  - C-c / T or C-u  specific TODO
  - C-c N   show the tree Nth keyword in org-todo-keywords
- ‘C-c a t     (org-todo-list)’
- ‘S-M-<RET>     (org-insert-todo-heading)’
org-todo-state-tags-triggers
** TODO extensions
*** ^
org-todo-keywords
*** Workflow states
(setq org-todo-keywords
   '((sequence "TODO" "FEEDBACK" "VERIFY" "|" "DONE" "DELEGATED")))
*** TODO types
(setq org-todo-keywords '((type "Fred" "Sara" "Lucy" "|" "DONE")))
