note/info/OrgMode/note.tex
\subsubsection{create table}
\label{sec:orgd54618e}
\begin{center}
\begin{tabular}{lll}
Name & Phone & Age\\
\hline
\end{tabular}
\end{center}
type <TAB>

\begin{center}
\begin{tabular}{lll}
Name & Phone & Age\\
\end{tabular}
\end{center}
type C-c <RET>
\subsubsection{keybindings}
\label{sec:org8bf0781}
\begin{itemize}
\item ‘C-c |     (org-table-create-or-convert-from-region)’
\begin{itemize}
\item convert region to table
\item C-u ‘C-u’ forces CSV, ‘C-u C-u’ forces TAB, ‘C-u C-u C-u’ will prompt for a regular expression.
\item no active region then just create
\end{itemize}
\item ‘C-c C-c     (org-table-align)’
\item ‘C-c <SPC>     (org-table-blank-field)’
\item ‘<TAB>     (org-table-next-field)’
\item ‘S-<TAB>     (org-table-previous-field)’
\item ‘<RET>     (org-table-next-row)’
\item ‘M-a     (org-table-beginning-of-field)’
\item ‘M-e     (org-table-end-of-field)’
\item ‘M-<LEFT>     (org-table-move-column-left)’
\item ‘M-<RIGHT>     (org-table-move-column-right)’
\item ‘M-S-<LEFT>     (org-table-delete-column)’
\item ‘M-S-<RIGHT>     (org-table-insert-column)’
\item ‘M-<UP>     (org-table-move-row-up)’
\item ‘M-<DOWN>     (org-table-move-row-down)’
\item ‘M-S-<UP>     (org-table-kill-row)’
\item ‘M-S-<DOWN>     (org-table-insert-row)’
\item ‘C-c -     (org-table-insert-hline)’
\item ‘C-c <RET>     (org-table-hline-and-move)’
\begin{itemize}
\item + C-c
\end{itemize}
\item ‘C-c C-x M-w     (org-table-copy-region)’
\item ‘C-c C-x C-w     (org-table-cut-region)’
\item ‘C-c C-x C-y     (org-table-paste-rectangle)’
\item ‘M-<RET>     (org-table-wrap-region)’
\begin{itemize}
\item + C-u change the number of desired lines.
\end{itemize}
\item ‘C-c +     (org-table-sum)’
\begin{itemize}
\item inserted with C-y
\end{itemize}
\item ‘S-<RET>     (org-table-copy-down)’
\begin{itemize}
\item integer field values will be incremented. prefix 0 disable increment.
\end{itemize}
\item ‘C-c `     (org-table-edit-field)’
\begin{itemize}
\item in a separate window
\item + C-u full visible
\item + C-u C-u separate window follow the cursor.
\end{itemize}
\item ‘M-x org-table-import <RET>’
\begin{itemize}
\item import a file as a table. separator <TAB>
\item + C-u determine the separator.
\end{itemize}
\item ‘C-c |     (org-table-create-or-convert-from-region)’
\item ‘M-x org-table-export <RET>’
\begin{itemize}
\item ‘org-table-export-default-format’.‘TABLE\(_{\text{EXPORT}}\)\(_{\text{FILE}}\)’ and ‘TABLE\(_{\text{EXPORT}}\)\(_{\text{FORMAT}}\)’
\end{itemize}
\end{itemize}
\subsubsection{footnoteInfo}
\label{sec:orgd149ae1}
(1) To insert a vertical bar into a table field, use ‘\(\vert{}\)’ or,
inside a word ‘abc\(\vert{}\)def’.
\subsection{Column width and alignment}
\label{sec:orgb3d6ada}
set width of a column:
<N>
inside field.

C-c ` 

‘org-startup-align-all-tables’ 
per-file basis with:
alignment:
<r><c><l>
\subsection{Column groups}
\label{sec:org3e7ee2e}
\begin{center}
\begin{tabular}{r|rrr|rr|}
N & N\(^{\text{2}}\) & N\(^{\text{3}}\) & N\(^{\text{4}}\) & \texttt{sqrt(n)} & \texttt{sqrt[4](N)}\\
\hline
1 & 1 & 1 & 1 & 1 & 1\\
\hline
\end{tabular}
\end{center}
\subsection{Orgtbl mode}
\label{sec:org03f4afb}
‘M-x orgtbl-mode <RET>’.

(add-hook 'message-mode-hook 'turn-on-orgtbl)
\subsection{The spreadsheet}
\label{sec:org24419f4}
\subsubsection{References}
\label{sec:org9e89aeb}
\begin{enumerate}
\item \^{}
\label{sec:orgaf18a6f}
C-c ?  coordinates of a field are.
C-c \}  toggle the display of a grid.
\item Field references
\label{sec:org91fe00d}
\begin{itemize}
\item @ROW\$COLUMN
\begin{itemize}
\item column
\begin{itemize}
\item \$0 current
\item \$1 \$2 \ldots{}
\item \$+1 \ldots{}
\item \$< first \$> last
\item \$>>> third column from the right
\end{itemize}
\item row
\begin{itemize}
\item @0 current
\item @1 \ldots{}
\item @+1 \ldots{}
\item @< @>
\item @I first hline(horizontal separator)
\item @II
\item @-1
\item @III+2
\end{itemize}
\end{itemize}
\item references
\begin{itemize}
\item with unsigned numbers fixed.
\item with signed numbers relative.
\end{itemize}
\end{itemize}
\item Range references
\label{sec:org22d0ec9}
\ldots{}
return a vector
\item Field coordinates in formulas
\label{sec:org374a196}
@\# org-table-current-dline
\$\# org-table-current-column
\item Named references
\label{sec:org5c6cc54}
\$name
org-table-formula-constants

\$PROP\(_{\text{Xyz}}\)
\begin{itemize}
\item constants.el
\begin{itemize}
\item \$I \#+STARTUP  constSI
\item cgs \#+STARTUP  constcgs
\item constants-unit-system
\end{itemize}
\end{itemize}
\item Remote references
\label{sec:orgd9d132f}
\begin{itemize}
\item remote(NAME-OR-ID,REF)
\begin{itemize}
\item NAME ‘\#+NAME: Name’ line before the table.
\item NAME @ROW\$COLUMN    this is indirection of NAME-OR-ID.
\end{itemize}
\end{itemize}
\end{enumerate}
\subsubsection{Formula syntax for Calc}
\label{sec:org0dac23f}
a/b*c  ==  a/(b*c)
mode string after a semicolon.
‘org-calc-default-modes’.
\subsubsection{Formula syntax for Lisp}
\label{sec:orgb50ecd8}
'()
\subsubsection{Durations and time values}
\label{sec:orgb2b0f73}
\subsubsection{Field and range formulas}
\label{sec:org19fd4e8}
\subsubsection{Column formulas}
\label{sec:org18998f7}
\subsubsection{Lookup functions}
\label{sec:orge06a89b}
\subsubsection{Editing and debugging formulas}
\label{sec:org89143ff}
\subsubsection{Updating the table}
\label{sec:orga6d4922}
\subsubsection{Advanced features}
\label{sec:org3a1b23b}
\subsection{Org-Plot}
\label{sec:org4d8cb07}
\subsubsection{Graphical plots using ‘Gnuplot’}
\label{sec:orgcfcd711}
\subsubsection{ASCII bar plots}
\label{sec:org8a265ed}
C-c " a
M-x orgtbl-ascii-plot <RET>
\section{Hyperlinks}
\label{sec:org5c1fc01}
\subsection{Link format}
\label{sec:orgc50d120}
[[link][description] ] or [[link] ]   erase ' '
\subsection{Internal links}
\label{sec:org081b1aa}
\begin{itemize}
\item ‘[ [\#my-custom-id]]’ link to ‘CUSTOM\(_{\text{ID}}\)’ property ‘my-custom-id’.
\item \ref{org6f0e3cb} \hyperref[org6f0e3cb]{find my target}
\begin{itemize}
\item C-c C-o follow link
\end{itemize}
\end{itemize}
\label{org6f0e3cb}
search for headline

C-c \&  previous position of mark ring.
Radio targets C-c C-c on target
\subsection{External links}
\label{sec:org179efc9}
[[string:someString] ]    no ' '
\subsection{Handling links}
\label{sec:orgb79d198}
\begin{itemize}
\item ‘C-c l     (org-store-link)’
\item ‘C-c C-l     (org-insert-link)’
\item ‘C-u C-c C-l’  link to file
\item ‘C-u C-u C-c C-l’ link to file as absolute path
\item ‘C-c C-l  (with cursor on existing link)’   edit
\item ‘C-c C-o     (org-open-at-point)’
\begin{itemize}
\item + C-u  with emacs
\item + C-u C-u  avoid with emacs
\item org-link-frame-setup
\end{itemize}
\item ‘<RET>’
\begin{itemize}
\item org-return-follows-link
\end{itemize}
\item ‘C-c C-x C-v     (org-toggle-inline-images)’
\begin{itemize}
\item org-startup-with-inline-images
\item ‘\#+STARTUP’ keywords ‘inlineimages’ and ‘noinlineimages’
\end{itemize}
\item ‘C-c \%     (org-mark-ring-push)’
\item ‘C-c \&     (org-mark-ring-goto)’
\item ‘C-c C-x C-n     (org-next-link)’
\item ‘C-c C-x C-p     (org-previous-link)’
\end{itemize}

\subsection{Using links outside Org}
\label{sec:orga450ba4}
(global-set-key "\C-c L" 'org-insert-link-global)
(global-set-key "\C-c o" 'org-open-at-point-global)
\subsection{Link abbreviations}
\label{sec:orgf86a0fd}
[[linkword:tag][description] ]  with no blank
(setq org-link-abbrev-alist
 '()
)
\%s \%h \%(my-function)
\url{http://www.google.com/search?q=OrgMode}

(org-link-set-parameters ``type'' :complete \#'some-function)
\subsection{Search options}
\label{sec:org3d7e429}
:: 

\url{file:///home/d/code/main.c}
\url{file:///home/d/xx.org}
\url{file:///home/d/xx.org}
[[\url{file:///home/d/xx.org}] ]
\url{file:///home/d/xx.org}
\url{}
\subsection{Custom searches}
\label{sec:org965afd2}
‘org-create-file-search-functions’
‘org-execute-file-search-functions’
\section{{\bfseries\sffamily TODO} items}
\label{sec:orgd4ca0b2}
\subsection{{\bfseries\sffamily TODO} basics}
\label{sec:org4102bb4}
\begin{itemize}
\item ‘C-c C-t     (org-todo)’
\begin{itemize}
\item ‘org-use-fast-todo-selection’
\item ‘C-u C-c C-t’ prompt
\end{itemize}
\item ‘S-<RIGHT>  /  S-<LEFT>’ cycling
\begin{itemize}
\item ‘shift-selection-mode’
\item ‘org-treat-S-cursor-todo-selection-as-state-change’
\end{itemize}
\item ‘C-c / t     (org-show-todo-tree)’  view TODO items
\begin{itemize}
\item C-c / T or C-u  specific TODO
\item C-c N   show the tree Nth keyword in org-todo-keywords
\end{itemize}
\item ‘C-c a t     (org-todo-list)’
\item ‘S-M-<RET>     (org-insert-todo-heading)’
\end{itemize}
org-todo-state-tags-triggers
\subsection{{\bfseries\sffamily TODO} extensions}
\label{sec:orgdc9d6f4}
\subsubsection{\^{}}
\label{sec:org298ded8}
org-todo-keywords
\subsubsection{Workflow states}
\label{sec:org853f4a3}
(setq org-todo-keywords
   '((sequence "TODO" "FEEDBACK" "VERIFY" "|" "DONE" "DELEGATED")))
\subsubsection{{\bfseries\sffamily TODO} types}
\label{sec:org05f7f6a}
(setq org-todo-keywords '((type "Fred" "Sara" "Lucy" "|" "DONE")))
