note/Info(C-h i)/OrgMode/note.org
*** Multiple sets in one file
     (setq org-todo-keywords
           '((sequence "TODO" "|" "DONE")
             (sequence "REPORT" "BUG" "KNOWNCAUSE" "|" "FIXED")
             (sequence "|" "CANCELED")))

‘C-u C-u C-c C-t’
‘C-S-<RIGHT>’
‘C-S-<LEFT>’
     These keys jump from one TODO subset to the next.
‘S-<RIGHT>’
‘S-<LEFT>’
     walk through _all_ keywords from all.
shift-selection-mode
*** Fast access to TODO states
     (setq org-todo-keywords
           '((sequence "TODO(t)" "|" "DONE(d)")
             (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
             (sequence "|" "CANCELED(c)")))
org-fast-tag-selection-include-todo
*** Per-file keywords
#+TODO: TODO FEEDBACK VERIFY | DONE CANCELED
or
#+TYP_TODO: Fred Sara Lucy Mike | DONE

#+TODO == #SEQ_TODO

M-<TAB> completion

C-c C-c  make the changes known to org mode.
*** Faces for TODO keywords
org-todo 
org-done

(setq org-todo-keyword-faces
           '(("TODO" . org-warning) ("STARTED" . "yellow")
             ("CANCELED" . (:foreground "blue" :weight bold))))

org-faces-easy-properties
*** dependencies
    :PROPERTIES:
    :END:
org-enforce-todo-dependencies  block done while children undone
property ORDERED blocked until earlier siblings done.

:PROPERTIES:
:ORDERED: t
:END:

:PROPERTIES:
:NOBLOCKING: t
:END:

‘C-c C-x o     (org-toggle-ordered-property)’
‘C-u C-u C-u C-c C-t’ circumventing any state blocking

org-depend.el  more complex dependency structures.
** Progress logging
*** DONE Closing items
(setq org-log-done 'time)
(setq org-log-done 'note)

‘#+STARTUP: logdone’
‘#+STARTUP: lognotedone’.
*** Tracking TODO state changes
newest first.  org-log-states-order-reversed
org-log-into-drawer
LOGBOOK
LOG_INTO_DRAWER

‘!’ (for a timestamp) 
‘@’ (for a note with timestamp)

(setq org-todo-keywords
    '((sequence "TODO(t)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@)")))
/!
the note taken when entering the state, 
a timestamp should be recorded when leaving the WAIT state.

- TODO Log each state with only a time
  :LOGGING: TODO(!) WAIT(!) DONE(!) CANCELED(!)
- TODO Only log when switching to WAIT, and when repeating
  :LOGGING: WAIT(@) logrepeat
- TODO No logging at all
  :LOGGING: nil
*** Tracking your habits
**** TODO Shave
     SCHEDULED: <2009-10-17 Sat .+2d/4d>
     :PROPERTIES:
     :STYLE:    habit
     :LAST_REPEAT: [2009-10-19 Mon 00:36]
     :END:
‘org-habit-graph-column’
‘org-habit-preceding-days’
‘org-habit-following-days’
‘org-habit-show-habits-only-for-today’
** TODO Priorities
TODO [#A] headline
A B(without a cookie is treated like B) C
org-priority-faces

- ‘C-c ,’   (‘org-priority’)
- ‘S-<UP>     (org-priority-up)’
- ‘S-<DOWN>     (org-priority-down)’
  - org-priority-start-cycle-with-default

‘org-highest-priority’
‘org-lowest-priority’
‘org-default-priority’
** Breaking down tasks
[/] [%] overview
C-c C-c update each time

- COOKIE_DATA
  - ‘checkbox’
  - ‘todo’ 

‘org-hierarchical-todo-statistics’.  
:COOKIE_DATA: todo recursive

automatically to done when children are done :
(defun org-summary-todo (n-done n-not-done)
       "Switch entry to DONE when all subentries are done, to TODO otherwise."
       (let (org-log-done org-log-states)   ; turn off logging
         (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
** Checkboxes
- ‘C-c C-c     (org-toggle-checkbox)’
  - C-u C-u +  [-] 
- ‘C-c C-x C-b     (org-toggle-checkbox)’
  - C-u +  checkbox presence
  - C-u C-u  [-] 
  - active region:
  - cursor in a headline:
  - no active:
- ‘M-S-<RET>     (org-insert-todo-heading)’
- ‘C-c C-x o     (org-toggle-ordered-property)’
  - org-track-ordered-property-with-tag
- ‘C-c #     (org-update-statistics-cookies)’
  - C-u +  update the entire file
* Tags
** ^
** Tag inheritance
#+FILETAGS: :Peter:Boss:Secret:
org-tags-exclude-from-inheritance
org-use-tag-inheritance
org-tags-match-list-sublevels
org-agenda-use-tag-inheritance
** Setting tags
:tag
M-<TAB> completion
- ‘C-c C-q     (org-set-tags-command)’
  - org-tags-column
  - C-u +  realign
- ‘C-c C-c     (org-set-tags-command)’

- list of tags:
  - dynamically: used in current buffer.
  - globally: org-tag-alist
  - given file:
    #+TAGS: @work @home @tennisclub
    #+TAGS: laptop car pc sailboat
  - #+TAGS: ::use dynamic taglist

org-tag-persistent-alist
#+STARTUP: noptag

- fast tag selection:
  - (setq org-tag-alist '(("@work" . ?w) ("@home" . ?h) ("laptop" . ?l)))
  - #+TAGS: @work(w)  @home(h)  @tennisclub(t)  laptop(l)  pc(p)
  - #+TAGS: @work(w)  @home(h)  @tennisclub(t) \n laptop(l)  pc(p)
    - #+TAGS: @work(w)  @home(h)  @tennisclub(t)
      #+TAGS: laptop(l)  pc(p)
  - #+TAGS: { @work(w)  @home(h)  @tennisclub(t) }  laptop(l)  pc(p)
C-c C-c activate any changes

mutually exclusive groups in the variable ‘org-tag-alist’,
‘:startgroup’ ‘:endgroup’
‘:newline’

org-fast-tag-selection-single-key
** Tag hierarchy
#+TAGS: [ GTD : Control Persp ]
#+TAGS: [ Control : Context Task ]
#+TAGS: [ Persp : Vision Goal AOF Project ]
(setq org-tag-alist '((:startgrouptag)
                           ("GTD")
                           (:grouptags)
                           ("Control")
                           ("Persp")
                           (:endgrouptag)
                           (:startgrouptag)
                           ("Control")
                           (:grouptags)
                           ("Context")
                           ("Task")
                           (:endgrouptag)))
#+TAGS: { Context : @Home @Work @Call }
mutually exclusive:
‘org-tag-alist’:
‘:startgroup’ ‘:endgroup’
‘:startgrouptag’ & ‘:endgrouptag’

#+TAGS: [ Vision : {V@.+} ]

org-toggle-tags-groups
org-group-tags
** Tag searches
- ‘C-c / m  or  C-c \     (org-match-sparse-tree)’
  - + C-u ignore not TODO line
- ‘C-c a m     (org-tags-view)’
- ‘C-c a M     (org-tags-view)’
* Properties and columns
** Property syntax
   :PROPERTIES:
   :Title:    Goldberg Variations
   :Composer: J.S. Bach
   :Artist:   Glen Gould
   :Publisher: Deutsche Grammophon
   :NDisks:   1
   :END:
Properties are key-value pairs.
org-use-property-inheritance

:xyz: one of :xyzALL:

C-c C-c to activete this change.

#+PROPERTY: var  foo=1
#+PROPERTY: var+ bar=2

org-global-properties

‘M-<TAB>     (pcomplete)’
‘C-c C-x p     (org-set-property)’
‘C-u M-x org-insert-drawer <RET>’
‘C-c C-c     (org-property-action)’
‘C-c C-c s     (org-set-property)’
‘S-<RIGHT>     (org-property-next-allowed-value)’
‘S-<LEFT>     (org-property-previous-allowed-value)’
‘C-c C-c d     (org-delete-property)’
‘C-c C-c D     (org-delete-property-globally)’
‘C-c C-c c     (org-compute-property-at-point)’
** Special properties
** Property searches
‘C-c / m  or  C-c \     (org-match-sparse-tree)’
‘C-c a m     (org-tags-view)’
‘C-c a M     (org-tags-view)’
‘C-c / p’
** Property inheritance
org-use-property-inheritance
hard code:
‘COLUMNS’
‘CATEGORY’
‘ARCHIVE’
‘LOGGING’
** Column view
*** Defining columns
**** Scope of column definitions
#+COLUMNS: %25ITEM %TAGS %PRIORITY %TOOD 
:COLUMNS: %25ITEM %TAGS %PRIORITY %TODO
**** Column attributes
%[WIDTH]PROPERTY[(TITLE)][{SUMMARY-TYPE}]
