note/info/OrgMode/note.tex
\subsubsection{Multiple sets in one file}
\label{sec:orge76d66a}
(setq org-todo-keywords
      '((sequence "TODO" "|" "DONE")
        (sequence "REPORT" "BUG" "KNOWNCAUSE" "|" "FIXED")
        (sequence "|" "CANCELED")))

‘C-u C-u C-c C-t’
‘C-S-<RIGHT>’
‘C-S-<LEFT>’
     These keys jump from one TODO subset to the next.
‘S-<RIGHT>’
‘S-<LEFT>’
     walk through \uline{all} keywords from all.
shift-selection-mode
\subsubsection{Fast access to TODO states}
\label{sec:orgbfe3480}
     (setq org-todo-keywords
           '((sequence "TODO(t)" "|" "DONE(d)")
             (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
             (sequence "|" "CANCELED(c)")))
org-fast-tag-selection-include-todo
\subsubsection{Per-file keywords}
\label{sec:orgcdba399}
or
\#+TODO == \#SEQ\(_{\text{TODO}}\)

M-<TAB> completion

C-c C-c  make the changes known to org mode.
\subsubsection{Faces for TODO keywords}
\label{sec:org32296c3}
org-todo 
org-done

(setq org-todo-keyword-faces
           '(("TODO" . org-warning) ("STARTED" . "yellow")
             ("CANCELED" . (:foreground "blue" :weight bold))))

org-faces-easy-properties
\subsubsection{dependencies}
\label{sec:org477efcc}
org-enforce-todo-dependencies  block done while children undone
property ORDERED blocked until earlier siblings done.

:ORDERED: t

:NOBLOCKING: t

‘C-c C-x o     (org-toggle-ordered-property)’
‘C-u C-u C-u C-c C-t’ circumventing any state blocking

org-depend.el  more complex dependency structures.
\subsection{Progress logging}
\label{sec:org94a6ea5}
\subsubsection{{\bfseries\sffamily DONE} Closing items}
\label{sec:org706325a}
(setq org-log-done 'time)
(setq org-log-done 'note)

‘\#+STARTUP: logdone’
‘\#+STARTUP: lognotedone’.
\subsubsection{Tracking TODO state changes}
\label{sec:org30de272}
newest first.  org-log-states-order-reversed
org-log-into-drawer
LOGBOOK
LOG\(_{\text{INTO}}\)\(_{\text{DRAWER}}\)

‘!’ (for a timestamp) 
‘@’ (for a note with timestamp)

(setq org-todo-keywords
    '((sequence "TODO(t)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@)")))
/!
the note taken when entering the state, 
a timestamp should be recorded when leaving the WAIT state.

\begin{itemize}
\item TODO Log each state with only a time
:LOGGING: TODO(!) WAIT(!) DONE(!) CANCELED(!)
\item TODO Only log when switching to WAIT, and when repeating
:LOGGING: WAIT(@) logrepeat
\item TODO No logging at all
:LOGGING: nil
\end{itemize}
\subsubsection{Tracking your habits}
\label{sec:org582f068}
\begin{enumerate}
\item {\bfseries\sffamily TODO} Shave
\label{sec:org0d66577}
‘org-habit-graph-column’
‘org-habit-preceding-days’
‘org-habit-following-days’
‘org-habit-show-habits-only-for-today’
\end{enumerate}
\subsection{{\bfseries\sffamily TODO} Priorities}
\label{sec:org1ec7b87}
TODO [\#A] headline
A B(without a cookie is treated like B) C
org-priority-faces

\begin{itemize}
\item ‘C-c ,’   (‘org-priority’)
\item ‘S-<UP>     (org-priority-up)’
\item ‘S-<DOWN>     (org-priority-down)’
\begin{itemize}
\item org-priority-start-cycle-with-default
\end{itemize}
\end{itemize}

‘org-highest-priority’
‘org-lowest-priority’
‘org-default-priority’
\subsection{Breaking down tasks}
\label{sec:org7c2d306}
[/] [\%] overview
C-c C-c update each time

\begin{itemize}
\item COOKIE\(_{\text{DATA}}\)
\begin{itemize}
\item ‘checkbox’
\item ‘todo’
\end{itemize}
\end{itemize}

‘org-hierarchical-todo-statistics’.  
:COOKIE\(_{\text{DATA}}\): todo recursive

automatically to done when children are done :
(defun org-summary-todo (n-done n-not-done)
       "Switch entry to DONE when all subentries are done, to TODO otherwise."
       (let (org-log-done org-log-states)   ; turn off logging
         (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
\subsection{Checkboxes}
\label{sec:orgb574004}
\begin{itemize}
\item ‘C-c C-c     (org-toggle-checkbox)’
\begin{itemize}
\item C-u C-u +  [-]
\end{itemize}
\item ‘C-c C-x C-b     (org-toggle-checkbox)’
\begin{itemize}
\item C-u +  checkbox presence
\item C-u C-u  [-]
\item active region:
\item cursor in a headline:
\item no active:
\end{itemize}
\item ‘M-S-<RET>     (org-insert-todo-heading)’
\item ‘C-c C-x o     (org-toggle-ordered-property)’
\begin{itemize}
\item org-track-ordered-property-with-tag
\end{itemize}
\item ‘C-c \#     (org-update-statistics-cookies)’
\begin{itemize}
\item C-u +  update the entire file
\end{itemize}
\end{itemize}
\section{Tags}
\label{sec:orgd83fbbe}
\subsection{\^{}}
\label{sec:org883b147}
\subsection{Tag inheritance}
\label{sec:org61b8022}
org-tags-exclude-from-inheritance
org-use-tag-inheritance
org-tags-match-list-sublevels
org-agenda-use-tag-inheritance
\subsection{Setting tags}
\label{sec:orgcb2de26}
:tag
M-<TAB> completion
\begin{itemize}
\item ‘C-c C-q     (org-set-tags-command)’
\begin{itemize}
\item org-tags-column
\item C-u +  realign
\end{itemize}
\item ‘C-c C-c     (org-set-tags-command)’

\item list of tags:
\begin{itemize}
\item dynamically: used in current buffer.
\item globally: org-tag-alist
\item given file:
\item \#+TAGS: ::use dynamic taglist
\end{itemize}
\end{itemize}

org-tag-persistent-alist
\begin{itemize}
\item fast tag selection:
\begin{itemize}
\item (setq org-tag-alist '(("@work" . ?w) ("@home" . ?h) ("laptop" . ?l)))
\item \#+TAGS: @work(w)  @home(h)  @tennisclub(t)  laptop(l)  pc(p)
\item \#+TAGS: @work(w)  @home(h)  @tennisclub(t) \n laptop(l)  pc(p)
\begin{itemize}
\item \#+TAGS: @work(w)  @home(h)  @tennisclub(t)
\end{itemize}
\item \#+TAGS: \{ @work(w)  @home(h)  @tennisclub(t) \}  laptop(l)  pc(p)
\end{itemize}
\end{itemize}
C-c C-c activate any changes

mutually exclusive groups in the variable ‘org-tag-alist’,
‘:startgroup’ ‘:endgroup’
‘:newline’

org-fast-tag-selection-single-key
\subsection{Tag hierarchy}
\label{sec:org348e898}
(setq org-tag-alist '((:startgrouptag)
                           ("GTD")
                           (:grouptags)
                           ("Control")
                           ("Persp")
                           (:endgrouptag)
                           (:startgrouptag)
                           ("Control")
                           (:grouptags)
                           ("Context")
                           ("Task")
                           (:endgrouptag)))
mutually exclusive:
‘org-tag-alist’:
‘:startgroup’ ‘:endgroup’
‘:startgrouptag’ \& ‘:endgrouptag’

org-toggle-tags-groups
org-group-tags
\subsection{Tag searches}
\label{sec:orgc537d96}
\begin{itemize}
\item ‘C-c / m  or  C-c $\backslash$     (org-match-sparse-tree)’
\begin{itemize}
\item + C-u ignore not TODO line
\end{itemize}
\item ‘C-c a m     (org-tags-view)’
\item ‘C-c a M     (org-tags-view)’
\end{itemize}
\section{Properties and columns}
\label{sec:org2c66813}
\subsection{Property syntax}
\label{sec:orgbff0698}
Properties are key-value pairs.
org-use-property-inheritance

:xyz: one of :xyzALL:

C-c C-c to activete this change.

org-global-properties

‘M-<TAB>     (pcomplete)’
‘C-c C-x p     (org-set-property)’
‘C-u M-x org-insert-drawer <RET>’
‘C-c C-c     (org-property-action)’
‘C-c C-c s     (org-set-property)’
‘S-<RIGHT>     (org-property-next-allowed-value)’
‘S-<LEFT>     (org-property-previous-allowed-value)’
‘C-c C-c d     (org-delete-property)’
‘C-c C-c D     (org-delete-property-globally)’
‘C-c C-c c     (org-compute-property-at-point)’
\subsection{Special properties}
\label{sec:orgb23c3c1}
\subsection{Property searches}
\label{sec:orgf1cb5e3}
‘C-c / m  or  C-c $\backslash$     (org-match-sparse-tree)’
‘C-c a m     (org-tags-view)’
‘C-c a M     (org-tags-view)’
‘C-c / p’
\subsection{Property inheritance}
\label{sec:org84b3d43}
org-use-property-inheritance
hard code:
‘COLUMNS’
‘CATEGORY’
‘ARCHIVE’
‘LOGGING’
\subsection{Column view}
\label{sec:org87f789e}
\subsubsection{Defining columns}
\label{sec:orge6f7124}
\begin{enumerate}
\item Scope of column definitions
\label{sec:org3333ef2}
:COLUMNS: \%25ITEM \%TAGS \%PRIORITY \%TODO
\item Column attributes
\label{sec:org7b8d0d1}
\%[WIDTH]PROPERTY[(TITLE)][\{SUMMARY-TYPE\}]
\end{enumerate}
