note/Info(C-h i)/OrgMode/note.org
*** Using column view
    :PROPERTIES:
    :END:

    - ‘C-c C-x C-c     (org-columns)’
      - org-columns-default-format
      - ‘r     (org-columns-redo)’
      - ‘g     (org-columns-redo)’
      - ‘q     (org-columns-quit)’
      - ‘<LEFT> <RIGHT> <UP> <DOWN>’ move
      - ‘S-<LEFT>/<RIGHT>’ swithc value
      - ‘1..9,0’  select value
      - ‘n     (org-columns-next-allowed-value)’
      - ‘p     (org-columns-previous-allowed-value)’
      - ‘e     (org-columns-edit-value)’
      - ‘C-c C-c     (org-columns-set-tags-or-toggle)’
      - ‘v     (org-columns-show-value)’
      - ‘a     (org-columns-edit-allowed)’
      - ‘<     (org-columns-narrow)’
      - ‘>     (org-columns-widen)’
      - ‘S-M-<RIGHT>     (org-columns-new)’
      - ‘S-M-<LEFT>     (org-columns-delete)’
*** Capturing column view
- ‘:id’
  - local
  - global
  - "ID"
    - M-x org-id-copy <RET>
- ‘:hlines’
- ‘:vlines’
- ‘:maxlevel’
- ‘:maxlevel’
- ‘:indent’

- ‘C-c C-x i     (org-insert-columns-dblock)’
‘C-c C-c  or  C-c C-x C-u     (org-dblock-update)’
‘C-u C-c C-x C-u     (org-update-all-dblocks)’

#+TBLFM:
org-collector
** Property API

* Dates and times
** Timestamps
PLAIN TIMESTAMP; EVENT; APPOINTMENT
          * Meet Peter at the movies
            <2006-11-01 Wed 19:15>
TIMESTAMP WITH REPEATER INTERVAL
          * Pick up Sam at school
            <2007-05-16 Wed 12:30 +1w>
DIARY-STYLE SEXP ENTRIES
          * 22:00-23:00 The nerd meeting on every 2nd Thursday of the month
            <%%(diary-float t 4 2)>
TIME/DATE RANGE
          ** Meeting in Amsterdam
             <2004-08-23 Mon>--<2004-08-26 Thu>
INACTIVE TIMESTAMP
          * Gillian comes late for the fifth time
            [2006-11-01 Wed]
** Creating timestamps
*** ^
- ‘C-c .     (org-time-stamp)’
  - twice in succession, a time range is inserted.
- ‘C-c !     (org-time-stamp-inactive)’
- ‘C-u C-c .’ date and time 
- ‘C-u C-c !’ date and time 
- ‘C-c C-c’ Normalize timestamp
- ‘C-c <     (org-date-from-calendar)’
- ‘C-c >     (org-goto-calendar)’
- ‘C-c C-o     (org-open-at-point)’
- ‘S-<LEFT>     (org-timestamp-down-day)’
- ‘S-<RIGHT>     (org-timestamp-up-day)’
- ‘S-<UP>     (org-timestamp-up)’
- ‘S-<DOWN>     (org-timestamp-down-down)’
- ‘C-c C-y     (org-evaluate-time-range)’
  - with a prefix argument, insert result
*** The date/time prompt
     3-2-5         ⇒ 2003-02-05
     +0            ⇒ today

‘parse-time-months’ and ‘parse-time-weekdays’.
org-read-date-force-compatible-dates

    11am-1:15pm    ⇒ 11:00-13:15

You can control the calendar fully from the minibuffer:
     <RET>              Choose date at cursor in calendar.
     mouse-1            Select date by clicking on it.
     S-<RIGHT>/<LEFT>   One day forward/backward.
     S-<DOWN>/<UP>      One week forward/backward.
     M-S-<RIGHT>/<LEFT> One month forward/backward.
     > / <              Scroll calendar forward/backward by one month.
     M-v / C-v          Scroll calendar forward/backward by 3 months.
     M-S-<DOWN>/<UP>    Scroll calendar forward/backward by one year.
*** Custom time format(not recomend)
‘org-display-custom-times’
‘org-time-stamp-custom-formats’
‘C-c C-x C-t     (org-toggle-time-stamp-overlays)’
** Deadlines and scheduling
   :LOGBOOK:
   CLOCK: [2019-06-19 三 18:05]--[2019-06-19 三 18:30] =>  0:25
   CLOCK: [2019-06-19 三 18:05]--[2019-06-19 三 18:05] =>  0:00
   :END:
*** ^
DEADLINE
org-deadline-warning-days
org-agenda-skip-deadline-prewarning-if-scheduled
SCHEDULED
‘org-scheduled-delay-days’
‘org-agenda-skip-scheduled-delay-if-deadline’
*** Inserting deadline/schedule
    SCHEDULED: <2019-06-19 三> DEADLINE: <2019-06-19 三 20:00>
- ‘C-c C-d     (org-deadline)’
  - C-u +  remove
  - org-log-redeadline
  - ‘#+STARTUP’ keywords ‘logredeadline’,‘lognoteredeadline’, and ‘nologredeadline’
- ‘C-c C-s     (org-schedule)’
  - C-u + remove
  - org-log-reschedule
  - ‘#+STARTUP’ keywords ‘logreschedule’,‘lognotereschedule’, and ‘nologreschedule’
- ‘C-c / d     (org-check-deadlines)’
  - org-deadline-warning-days
  - C-u + show all in file
  - C-N + show N days
- ‘C-c / b     (org-check-before-date)’
- ‘C-c / a     (org-check-after-date)’
‘org-schedule’
‘org-deadline’
*** Repeated tasks
‘DEADLINE:<2005-10-01 Sat +1m -3d>’
++
.+
the variable ‘org-agenda-skip-scheduled-if-deadline-is-shown’ 
‘repeated-after-deadline’
C-c C-x c  copy subtree
** Clocking work time
*** DONE Clocking commands
    CLOSED: [2019-06-19 三 18:16]
    :PROPERTIES:
    :Effort:   0:33
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-19 三 18:11]--[2019-06-19 三 18:16] =>  0:05
    CLOCK: [2019-06-19 三 18:11]--[2019-06-19 三 18:11] =>  0:00
    CLOCK: [2019-06-19 三 18:10]--[2019-06-19 三 18:10] =>  0:00
    CLOCK: [2019-06-19 三 18:10]--[2019-06-19 三 18:10] =>  0:00
    CLOCK: [2019-06-19 三 18:10]--[2019-06-19 三 18:10] =>  0:00
    CLOCK: [2019-06-19 三 18:05]--[2019-06-19 三 18:05] =>  0:00
    CLOCK: [2019-06-19 三 18:04]--[2019-06-19 三 18:05] =>  0:01
    CLOCK: [2019-12-19 四 18:20]--[2019-12-19 四 19:10] =>  0:50
    :END:
- ‘C-c C-x C-i     (org-clock-in)’
  - org-clock-into-drawer
    - ‘CLOCK_INTO_DRAWER’ ‘LOG_INTO_DRAWER’ 
  - C-u + recently clocked tasks
  - C-u C-u + mark as default task      letter 'd'
  - C-u C-u C-u  continuous clocking
  - CLOCK_MODELINE_TOTAL
- ‘C-c C-x C-o     (org-clock-out)’
  - org-log-note-clock-out
    - ‘#+STARTUP: lognoteclock-out’
- ‘C-c C-x C-x     (org-clock-in-last)’
  - C-u + select
  - C-u C-u continuous clocking
- ‘C-c C-x C-e     (org-clock-modify-effort-estimate)’
- ‘C-c C-c  or  C-c C-y     (org-evaluate-time-range)’
- ‘C-S-<up/down>     (org-clock-timestamps-up/down)’
- ‘S-M-<up/down>     (org-timestamp-up/down)’
- ‘C-c C-t     (org-todo)’
- ‘C-c C-x C-q     (org-clock-cancel)’
- ‘C-c C-x C-j     (org-clock-goto)’
  - ‘C-u’ + select task
- ‘C-c C-x C-d     (org-clock-display)’
  - ‘org-remove-highlights-with-change’) 
  - ‘C-c C-c’.
*** The clock table
- ‘C-c C-x C-r     (org-clock-report)’
  - in existing clock table just update it
  - C-u first clock
- ‘C-c C-c  or  C-c C-x C-u     (org-dblock-update)’
- ‘C-u C-c C-x C-u’
‘S-<LEFT>’
‘S-<RIGHT>     (org-clocktable-try-shift)’

org-clocktable-defaults
org-clocktable-write-default
*** Resolving idle time
**** Resolving idle time
 org-clock-idle-time
‘M-x org-resolve-clocks <RET>’ (or‘C-c C-x C-z’).
k K s S C
**** Continuous clocking
org-clock-continuously
three uiversal arguments with ‘org-clock-in’ and 
two ‘C-u C-u’ with ‘org-clock-in-last’.
** Effort estimates
Effort estimates are stored in a special property ‘EFFORT’.
‘C-c C-x e     (org-set-effort)’
‘C-c C-x C-e     (org-clock-modify-effort-estimate)’
** Timers
Relative timer and countdown timer.
- ‘C-c C-x 0     (org-timer-start)’
- ‘C-c C-x ;     (org-timer-set-timer)’
- ‘C-c C-x .     (org-timer)’
  - C-u + relative timer restarted
- ‘C-c C-x -     (org-timer-item)’
  - C-u first reset the relative timer to 0.
- ‘M-<RET>     (org-insert-heading)’
- ‘C-c C-x ,     (org-timer-pause-or-continue)’
- ‘C-c C-x _     (org-timer-stop)’
* Capture - Refile - Archive
** Capture
*** ^
org-capture.el org-capture-templates
*** Setting up capture
(setq org-default-notes-file (concat org-directory "/notes.org"))
(define-key global-map "\C-cc" 'org-capture)
