note/info/OrgMode/note.tex
\subsubsection{Using column view}
\label{sec:org0719116}
\begin{itemize}
\item ‘C-c C-x C-c     (org-columns)’
\begin{itemize}
\item org-columns-default-format
\item ‘r     (org-columns-redo)’
\item ‘g     (org-columns-redo)’
\item ‘q     (org-columns-quit)’
\item ‘<LEFT> <RIGHT> <UP> <DOWN>’ move
\item ‘S-<LEFT>/<RIGHT>’ swithc value
\item ‘1..9,0’  select value
\item ‘n     (org-columns-next-allowed-value)’
\item ‘p     (org-columns-previous-allowed-value)’
\item ‘e     (org-columns-edit-value)’
\item ‘C-c C-c     (org-columns-set-tags-or-toggle)’
\item ‘v     (org-columns-show-value)’
\item ‘a     (org-columns-edit-allowed)’
\item ‘<     (org-columns-narrow)’
\item ‘>     (org-columns-widen)’
\item ‘S-M-<RIGHT>     (org-columns-new)’
\item ‘S-M-<LEFT>     (org-columns-delete)’
\end{itemize}
\end{itemize}
\subsubsection{Capturing column view}
\label{sec:orgfeeef3e}
\begin{itemize}
\item ‘:id’
\begin{itemize}
\item local
\item global
\item "ID"
\begin{itemize}
\item M-x org-id-copy <RET>
\end{itemize}
\end{itemize}
\item ‘:hlines’
\item ‘:vlines’
\item ‘:maxlevel’
\item ‘:maxlevel’
\item ‘:indent’

\item ‘C-c C-x i     (org-insert-columns-dblock)’
\end{itemize}
‘C-c C-c  or  C-c C-x C-u     (org-dblock-update)’
‘C-u C-c C-x C-u     (org-update-all-dblocks)’

org-collector
\subsection{Property API}
\label{sec:orgc9fa218}

\section{Dates and times}
\label{sec:orge6723d6}
\subsection{Timestamps}
\label{sec:org3d32a52}
PLAIN TIMESTAMP; EVENT; APPOINTMENT
\begin{itemize}
\item Meet Peter at the movies
\textit{<2006-11-01 三 19:15>}
\end{itemize}
TIMESTAMP WITH REPEATER INTERVAL
\begin{itemize}
\item Pick up Sam at school
\textit{<2007-05-16 三 12:30 +1w>}
\end{itemize}
DIARY-STYLE SEXP ENTRIES
\begin{itemize}
\item 22:00-23:00 The nerd meeting on every 2nd Thursday of the month
\textit{<\%\%(diary-float t 4 2)>}
\end{itemize}
TIME/DATE RANGE
          ** Meeting in Amsterdam
             \textit{<2004-08-23 一>--<2004-08-26 四>}
INACTIVE TIMESTAMP
\begin{itemize}
\item Gillian comes late for the fifth time
\textit{[2006-11-01 三]}
\end{itemize}
\subsection{Creating timestamps}
\label{sec:orgbd5119a}
\subsubsection{\^{}}
\label{sec:org5b89c34}
\begin{itemize}
\item ‘C-c .     (org-time-stamp)’
\begin{itemize}
\item twice in succession, a time range is inserted.
\end{itemize}
\item ‘C-c !     (org-time-stamp-inactive)’
\item ‘C-u C-c .’ date and time
\item ‘C-u C-c !’ date and time
\item ‘C-c C-c’ Normalize timestamp
\item ‘C-c <     (org-date-from-calendar)’
\item ‘C-c >     (org-goto-calendar)’
\item ‘C-c C-o     (org-open-at-point)’
\item ‘S-<LEFT>     (org-timestamp-down-day)’
\item ‘S-<RIGHT>     (org-timestamp-up-day)’
\item ‘S-<UP>     (org-timestamp-up)’
\item ‘S-<DOWN>     (org-timestamp-down-down)’
\item ‘C-c C-y     (org-evaluate-time-range)’
\begin{itemize}
\item with a prefix argument, insert result
\end{itemize}
\end{itemize}
\subsubsection{The date/time prompt}
\label{sec:org54dd5ee}
3-2-5         ⇒ 2003-02-05
+0            ⇒ today

‘parse-time-months’ and ‘parse-time-weekdays’.
org-read-date-force-compatible-dates

11am-1:15pm    ⇒ 11:00-13:15

You can control the calendar fully from the minibuffer:
     <RET>              Choose date at cursor in calendar.
     mouse-1            Select date by clicking on it.
     S-<RIGHT>/<LEFT>   One day forward/backward.
     S-<DOWN>/<UP>      One week forward/backward.
     M-S-<RIGHT>/<LEFT> One month forward/backward.
     > / <              Scroll calendar forward/backward by one month.
     M-v / C-v          Scroll calendar forward/backward by 3 months.
     M-S-<DOWN>/<UP>    Scroll calendar forward/backward by one year.
\subsubsection{Custom time format(not recomend)}
\label{sec:org51c56b2}
‘org-display-custom-times’
‘org-time-stamp-custom-formats’
‘C-c C-x C-t     (org-toggle-time-stamp-overlays)’
\subsection{Deadlines and scheduling}
\label{sec:org8cffed2}
\subsubsection{\^{}}
\label{sec:org1b20a56}
DEADLINE
org-deadline-warning-days
org-agenda-skip-deadline-prewarning-if-scheduled
SCHEDULED
‘org-scheduled-delay-days’
‘org-agenda-skip-scheduled-delay-if-deadline’
\subsubsection{Inserting deadline/schedule}
\label{sec:org7fe3b87}
\begin{itemize}
\item ‘C-c C-d     (org-deadline)’
\begin{itemize}
\item C-u +  remove
\item org-log-redeadline
\item ‘\#+STARTUP’ keywords ‘logredeadline’,‘lognoteredeadline’, and ‘nologredeadline’
\end{itemize}
\item ‘C-c C-s     (org-schedule)’
\begin{itemize}
\item C-u + remove
\item org-log-reschedule
\item ‘\#+STARTUP’ keywords ‘logreschedule’,‘lognotereschedule’, and ‘nologreschedule’
\end{itemize}
\item ‘C-c / d     (org-check-deadlines)’
\begin{itemize}
\item org-deadline-warning-days
\item C-u + show all in file
\item C-N + show N days
\end{itemize}
\item ‘C-c / b     (org-check-before-date)’
\item ‘C-c / a     (org-check-after-date)’
\end{itemize}
‘org-schedule’
‘org-deadline’
\subsubsection{Repeated tasks}
\label{sec:org3644891}
‘DEADLINE:\textit{<2005-10-01 六 +1m -3d>}’
\sout{+
.}
the variable ‘org-agenda-skip-scheduled-if-deadline-is-shown’ 
‘repeated-after-deadline’
C-c C-x c  copy subtree
\subsection{Clocking work time}
\label{sec:orgb2c5ab8}
\subsubsection{{\bfseries\sffamily DONE} Clocking commands}
\label{sec:org164453a}
\begin{itemize}
\item ‘C-c C-x C-i     (org-clock-in)’
\begin{itemize}
\item org-clock-into-drawer
\begin{itemize}
\item ‘CLOCK\(_{\text{INTO}}\)\(_{\text{DRAWER}}\)’ ‘LOG\(_{\text{INTO}}\)\(_{\text{DRAWER}}\)’
\end{itemize}
\item C-u + recently clocked tasks
\item C-u C-u + mark as default task      letter 'd'
\item C-u C-u C-u  continuous clocking
\item CLOCK\(_{\text{MODELINE}}\)\(_{\text{TOTAL}}\)
\end{itemize}
\item ‘C-c C-x C-o     (org-clock-out)’
\begin{itemize}
\item org-log-note-clock-out
\begin{itemize}
\item ‘\#+STARTUP: lognoteclock-out’
\end{itemize}
\end{itemize}
\item ‘C-c C-x C-x     (org-clock-in-last)’
\begin{itemize}
\item C-u + select
\item C-u C-u continuous clocking
\end{itemize}
\item ‘C-c C-x C-e     (org-clock-modify-effort-estimate)’
\item ‘C-c C-c  or  C-c C-y     (org-evaluate-time-range)’
\item ‘C-S-<up/down>     (org-clock-timestamps-up/down)’
\item ‘S-M-<up/down>     (org-timestamp-up/down)’
\item ‘C-c C-t     (org-todo)’
\item ‘C-c C-x C-q     (org-clock-cancel)’
\item ‘C-c C-x C-j     (org-clock-goto)’
\begin{itemize}
\item ‘C-u’ + select task
\end{itemize}
\item ‘C-c C-x C-d     (org-clock-display)’
\begin{itemize}
\item ‘org-remove-highlights-with-change’)
\item ‘C-c C-c’.
\end{itemize}
\end{itemize}
\subsubsection{The clock table}
\label{sec:org3d67950}
\begin{itemize}
\item ‘C-c C-x C-r     (org-clock-report)’
\begin{itemize}
\item in existing clock table just update it
\item C-u first clock
\end{itemize}
\item ‘C-c C-c  or  C-c C-x C-u     (org-dblock-update)’
\item ‘C-u C-c C-x C-u’
\end{itemize}
‘S-<LEFT>’
‘S-<RIGHT>     (org-clocktable-try-shift)’

org-clocktable-defaults
org-clocktable-write-default
\subsubsection{Resolving idle time}
\label{sec:orge362076}
\begin{enumerate}
\item Resolving idle time
\label{sec:orgf47cbaa}
 org-clock-idle-time
‘M-x org-resolve-clocks <RET>’ (or‘C-c C-x C-z’).
k K s S C
\item Continuous clocking
\label{sec:orge9e4da5}
org-clock-continuously
three uiversal arguments with ‘org-clock-in’ and 
two ‘C-u C-u’ with ‘org-clock-in-last’.
\end{enumerate}
\subsection{Effort estimates}
\label{sec:org35bebb3}
Effort estimates are stored in a special property ‘EFFORT’.
‘C-c C-x e     (org-set-effort)’
‘C-c C-x C-e     (org-clock-modify-effort-estimate)’
\subsection{Timers}
\label{sec:org46f5868}
Relative timer and countdown timer.
\begin{itemize}
\item ‘C-c C-x 0     (org-timer-start)’
\item ‘C-c C-x ;     (org-timer-set-timer)’
\item ‘C-c C-x .     (org-timer)’
\begin{itemize}
\item C-u + relative timer restarted
\end{itemize}
\item ‘C-c C-x -     (org-timer-item)’
\begin{itemize}
\item C-u first reset the relative timer to 0.
\end{itemize}
\item ‘M-<RET>     (org-insert-heading)’
\item ‘C-c C-x ,     (org-timer-pause-or-continue)’
\item ‘C-c C-x \_     (org-timer-stop)’
\end{itemize}
\section{Capture - Refile - Archive}
\label{sec:orgaa48992}
\subsection{Capture}
\label{sec:org78cb416}
\subsubsection{\^{}}
\label{sec:org7692ac2}
org-capture.el org-capture-templates
\subsubsection{Setting up capture}
\label{sec:org84d9b94}
(setq org-default-notes-file (concat org-directory "/notes.org"))
(define-key global-map "\C-cc" 'org-capture)
